[
    {
        "name": "Trending Topic Search",
        "details": "Search for topics what's currently trending on social media, and select the most popular and interesting one",
        "inputs": [
            "Start Signal"
        ],
        "output": "Trending Topic",
        "script_file": "InternetSearch.py"
    },
    {
        "name": "Specific Topic Internet Search",
        "details": "Do a detailed research about the selected topic",
        "inputs": [
            "Trending Topic"
        ],
        "output": "Researched Topic",
        "script_file": "InternetSearch.py"
    },
    {
        "name": "LLM - App Features Thinking",
        "details": "Given the following researched topic, think of an app, and define its features. Make it simple - something that can be implemented quickly as a prototype web app without a backend: ",
        "inputs": [
            "Researched Topic"
        ],
        "output": "App Feature Set",
        "script_file": "LLM.py"
    },
    {
        "name": "LLM - UI Designing",
        "details": "Using HTML and CSS, create the graphical user interface based on the app features described. If the code is pasted on a single html file, it should work as is. [output code only] [Respond with no formatting] [don't say anything else].",
        "inputs": [
            "App Feature Set"
        ],
        "output": "UI Design",
        "script_file": "LLM.py"
    },
    {
        "name": "LLM - Architecture",
        "details": "You are a web app architect. You will be given an idea for the app and you provide the architecture.\n\nScope\n- The app static web frontend only. There is no backend code, but you are free to utilize free public APIs in your design\n- You do not provide code, instead you just provide a high level design of the code\n- You determine what objects need to be implemented\n\nWhen provided with an app idea\n- Apply Object Oriented Design principles to design a solution for the app idea\n- You provide the objects that will need to be implemented\n- Design what methods each object has, and just give a pseucode for what they do\n\nFormat of your output\n- Provide the context of the app\n- Provide the high level design of the code\n- List down the objects along with their purposes, their methods and parameters, and their pseudocode\n- Describe in detail the coherence of the objects used to provide the solution for the app.",
        "inputs": [
            "App Feature Set",
            "UI Design"
        ],
        "output": "List of Classes with definitions",
        "script_file": "LLM.py"
    },
    {
        "name": "LLM - Coding",
        "details": "Complete the code so that everything will work as a web app. Provide the full code with no placeholders. If the code is pasted on a single html file, it should work as is. [output code only with no formatting or markup] [don't say anything else]",
        "inputs": [
            "List of Classes with definitions",
            "UI Design"
        ],
        "output": "App Prototype",
        "script_file": "LLM.py"
    },
    {
        "name": "File Write",
        "details": "",
        "inputs": [
            "File Path",
            "App Prototype"
        ],
        "output": "Output File Path",
        "script_file": "WriteToFile.py"
    }
]
